Repository: Einars-Apps/Matsjekk
Catalog: lib/l10n/app_*.arb
Languages: fi, nb, nl

# appTitle
source: Food Check
fi: Ruoka-tarkistus
nb: Matvare-sjekk
nl: Voedsel Check

source: Scan Barcode
fi: Skannaa viivakoodi
nb: Scan strekkode
nl: Barcode scannen

# productNotFound
source: Product not found in database.
fi: Tuotetta ei löytynyt tietokannasta.
nb: Produktet ble ikke funnet i databasen.
nl: Product niet in database gevonden.

# addToList
source: Add to Shopping List
fi: Lisää ostoslistalle
nb: Legg i handleliste
nl: Toevoegen aan boodschappenlijst

source: Shopping Lists
fi: Ostoslistat
nb: Handlelister
nl: Boodschappenlisten

source: History
fi: Historia
nb: Historikk
nl: Geschiedenis

source: Settings
fi: Asetukset
nb: Innstillinger
nl: Instellingen

source: About
fi: Tietoja sovelluksesta
nb: Om appen
nl: Over de app

# howAppWorks
source: How the App Works
fi: Kuinka sovellus toimii
nb: Hvordan appen henter info
nl: Hoe de app informatie ophaalt

# appDescription
source: The app uses Open Food Facts and an internal brand list to detect products with Bovaer, insect meal, GMO feed, and other controversial ingredients.
fi: Sovellus käyttää Open Food Facts -tietokantaa ja sisäistä merkkilistaa havaitakseen tuotteita, joissa voi olla Bovaer, hyönteislantaa, GMO-rehua ja muita kiistanalaisia aineosia.
nb: Appen bruker Open Food Facts og en intern liste for merkevare-koblinger til Bovaer, insektmel, GMO-fôr og andre kontroversielle ingredienser.
nl: De app gebruikt Open Food Facts en een interne merklijst om producten met Bovaer, insectenmeel, GMO-voer en andere controversiële ingrediënten te identificeren.

# alerts
source: Select Alerts
fi: Valitse hälytykset
nb: Velg varsler
nl: Selecteer waarschuwingen

source: Bovaer Alert
fi: Bovaer-hälytys
nb: Bovaer-varsel
nl: Bovaer-waarschuwing

source: Insect Meal Alert
fi: Hyönteislanta-hälytys
nb: Insektmel-varsel
nl: Insectenmeel-waarschuwing

# gmoFishAlert
source: GMO Fish Feed Alert
fi: GMO-kalarehu -hälytys
nb: GMO-fôr (Fisk)
nl: GMO-voer (Vis)

source: HIGH RISK
fi: KORKEA RISKI
nb: HØY RISIKO
nl: HOOG RISICO

source: POSSIBLE RISK
fi: MAHDOLLINEN RISKI
nb: MULIG RISIKO
nl: MOGELIJK RISICO

source: SAFE
fi: TURVALLINEN
nb: TRYGG
nl: VEILIG

source: UNKNOWN
fi: TUNNISTAMATON
nb: UKJENT
nl: ONBEKEND

# bovaerRiskDesc
source: The producer is directly linked to Bovaer.
fi: Tuottajalla on suora yhteys Bovaeriin.
nb: Produsenten er direkte knyttet til Bovaer.
nl: De producent is rechtstreeks gekoppeld aan Bovaer.

# insectMealRiskDesc
source: The product may contain insect meal.
fi: Tuote saattaa sisältää hyönteisproteiinia.
nb: Produktet kan inneholde insektmel.
nl: Het product kan insectenmeel bevatten.

# gmoFishRiskDesc
source: The producer is linked to GMO fish feed use.
fi: Tuottaja liittyy GMO-rehun käyttöön.
nb: Produsenten er knyttet til bruk av GMO-fôr.
nl: De producent is gekoppeld aan het gebruik van GMO-voer.

# safeDesc
source: The product is certified organic.
fi: Tuote on luomusertifioitu.
nb: Produktet er merket som økologisk.
nl: Het product is gecertificeerd biologisch.

source: Traceability
fi: Jäljitettävyys
nb: Sporbarhet
nl: Traceerbaarheid

source: Close
fi: Sulje
nb: Lukk
nl: Sluiten

source: Create
fi: Luo
nb: Opprett
nl: Aanmaken

source: Search
fi: Hae
nb: Søk
nl: Zoeken

source: Search Products
fi: Hae tuotteita
nb: Søk etter produkt
nl: Producten zoeken

source: No results
fi: Ei tuloksia
nb: Ingen resultater
nl: Geen resultaten

source: New List
fi: Uusi lista
nb: Ny liste
nl: Nieuwe lijst

# deleteList
source: Long press to delete
fi: Poista pitkällä painalluksella
nb: Langtikk for å slette
nl: Lang indrukken om te verwijderen

source: Language
fi: Kieli
nb: Språk / Language
nl: Taal

source: Select Language
fi: Valitse kieli
nb: Velg språk
nl: Selecteer taal

source: Norwegian
fi: Norja
nb: Norsk
nl: Noors

source: Swedish
fi: Ruotsi
nb: Svenska
nl: Zweeds

source: Danish
fi: Tanska
nb: Dansk
nl: Deens

source: Dutch
fi: Hollanti
nb: Nederlands
nl: Nederlands

source: French
fi: Ranska
nb: Français
nl: Frans

source: English
fi: Englanti
nl: Engels

source: German
fi: Saksa
nb: Deutsch
nl: Duits

source: Italian
fi: Italia
nb: Italiano
nl: Italiaans

source: Spanish
fi: Espanja
nb: Español
nl: Spaans

source: Portuguese
fi: Portugali
nb: Português
nl: Portugees

source: Change List Name
fi: Vaihda listan nimeä
nb: Endre listenavn
nl: Naam van lijst wijzigen

source: Cancel
fi: Peruuta
nb: Avbryt
nl: Annuleren

source: Save
fi: Tallenna
nb: Lagre
nl: Opslaan

# manualAddItem
source: Add item manually...
fi: Lisää tuote manuaalisesti...
nb: Legg til vare manuelt...
nl: Artikel handmatig toevoegen...

# emptyList
source: List is empty
fi: Lista on tyhjä
nb: Listen er tom
nl: Lijst is leeg

# noHistory
source: No history for this list
fi: Ei historiaa tälle listalle
nb: Ingen historikk for denne listen
nl: Geen historiek voor deze lijst

source: Global History
fi: Koko historia
nb: Global Historikk
nl: Globale historiek

source: New Shopping List
fi: Uusi ostoslista
nb: Ny handleliste
nl: Nieuwe boodschappenlijst

source: List Name
fi: Listan nimi
nb: Navn på liste
nl: Naam van lijst

source: No history found
fi: Ei historiaa
nb: Ingen historikk funnet
nl: Geen historiek gevonden

# addedItems
source: E-numbers
fi: E-aineet
nb: E-stoffer
nl: E-nummers

# identifiedAdditions
source: Identified E-numbers
fi: Tunnistetut E-aineet
nb: Identifiserte E-stoffer
nl: Geïdentificeerde E-nummers

# noAdditionsFound
source: No E-numbers found in database.
fi: Ei E-aineita tietokannassa.
nb: Ingen E-stoffer funnet i databasen.
nl: Geen E-nummers in database gevonden.

# disclaimer
source: Disclaimer: This information is for guidance only and based on publicly available data. For 100% accurate information, see the product packaging or contact the manufacturer.
fi: Vastuuvapaus: Tämä tieto on ohjeellinen ja perustuu julkisesti saatavilla olevaan dataan. Tarkista tuotteen pakkauksesta tai ota yhteyttä valmistajaan saadaksesi 100% tarkan tiedon.
nb: Ansvarsfraskrivelse: Informasjonen er veiledende og basert på offentlig kjente data. For 100% nøyaktig informasjon, se produktets emballasje eller kontakt produsenten.
nl: Disclaimer: Deze informatie is alleen ter oriëntatie en gebaseerd op openbaar beschikbare gegevens. Voor 100% nauwkeurige informatie raadpleegt u de verpakking van het product of neemt u contact op met de fabrikant.

# bovaerHighRisk
source: HIGH RISK: The producer is directly linked to Bovaer.
fi: KORKEA RISKI: Valmistajalla on suora yhteys Bovaeriin.
nb: HØY RISIKO: Produsenten er direkte knyttet til Bovaer.
nl: HOOG RISICO: De producent is rechtstreeks gekoppeld aan Bovaer.

# gmoHighRisk
source: HIGH RISK: The producer is linked to GMO fish feed use.
fi: KORKEA RISKI: Valmistaja liittyy GMO-rehun käyttöön.
nb: HØY RISIKO: Produsenten er knyttet til bruk av GMO-fôr.
nl: HOOG RISICO: De producent is gekoppeld aan het gebruik van GMO-voer.

# bovaerPossibleRisk
source: POSSIBLE RISK: The producer is a partner with companies linked to Bovaer.
fi: MAHDOLLINEN RISKI: Valmistaja on kumppani yritysten kanssa, jotka liittyvät Bovaeriin.
nb: MULIG RISIKO: Produsenten er en samarbeidspartner med aktører som er knyttet til Bovaer.
nl: MOGELIJK RISICO: De producent is partner van bedrijven gekoppeld aan Bovaer.

# safeProduct
source: SAFE: The product is certified organic.
fi: TURVALLINEN: Tuote on luomusertifioitu.
nb: TRYGG: Produktet er merket som økologisk.
nl: VEILIG: Het product is gecertificeerd biologisch.

source: Finnish
fi: Suomi
nb: Finsk

# searchHint
source: Search... (e.g. milk)
fi: Hae... (esim. maito)
nb: Søk... (f.eks. melk)

source: Delete
fi: Poista
nb: Slett

# deleteListConfirmTitle
source: Delete list?
fi: Poistetaanko lista?
nb: Slette liste?

# deleteListConfirmMessage
source: Are you sure? This will also delete the history for the list.
fi: Haluatko varmasti poistaa? Tämä poistaa myös listan historian.
nb: Er du sikker? Dette vil også slette historikken for listen.

source: Unknown product
fi: Tuntematon tuote
nb: Ukjent produkt
